""" 假设银行整存整取存款不同期限的月利率为：
0.63%,期限为1年;
0.66%,期限为2年;
0.69%,期限为3年;
0.75%,期限为5年;
0.84%,期限为8年;
现在已知某人手上有2000元,要求通过计算选出一款存钱方案, 使得这笔钱存入银行20年后的利息最多。假定银行对超出存款期限的那部分时间不付利息? """

if __name__ == "__main__":
    max = 0.0
    for x8 in range(0, 3):
        t5 = (20 - 8 * x8) // 5
        for x5 in range(0, t5 + 1):
            t3 = (20 - 8 * x8 - 5 * x5) // 3
            for x3 in range(0, t3 + 1):
                t2 = (20 - 8 * x8 - 5 * x5 - 3 * x3) // 2
                for x2 in range(0, t2 + 1):
                    x1 = 20 - 8 * x8 - 5 * x5 - 3 * x3 - 2 * x2
                    result = (
                        2000
                        * ((1 + 0.0063 * 12) ** x1)
                        * ((1 + 2 * 0.0066 * 12) ** x2)
                        * ((1 + 3 * 0.0069 * 12) ** x3)
                        * ((1 + 0.0078 * 12 * 5) ** x5)
                        * ((1 + 0.0084 * 12 * 8) ** x8)
                    )
                    if result > max:
                        max = result
                        y1 = x1
                        y2 = x2
                        y3 = x3
                        y5 = x5
                        y8 = x8
    print("%.3f" % result)
    print(y1)
    print(y2)
    print(y3)
    print(y5)
    print(y8)
